/**
@file pkt_capture.h
@author 남태일(taeil.nam@monitorapp.com)
@date 2025-07-17
@brief 패킷 캡처 관련 헤더파일
*/

#ifndef PKT_CAPTURE_H
#define PKT_CAPTURE_H

/*
********************************************************************************
* CONSTANTS
********************************************************************************
*/
#define MAX_PKT_CNTS 1000000000 /**< 캡처 가능한 최대 패킷 개수 */

/*
********************************************************************************
* PROTOTYPES
********************************************************************************
*/
void pkt_capture_setup(void);

#endif

